Revit 2027 API
StructuralType Enumeration
 Represents the structural type of a family instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralType
Public Enumeration StructuralType
public enum class StructuralType
type StructuralType
Members
Member name | Value | Description
Beam | 1 |  Structural Beam
Brace | 2 |  Structural Brace
Column | 3 |  Structural Column
Footing | 4 |  Structural Footing
NonStructural | 0 |  Non-Structural
UnknownFraming | 5 |  Unknown Framing
See Also
Reference
Autodesk.Revit.DB.Structure Namespace